jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32F207/FS_NOR_PHY_ST_STM32F207.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_PHY_ST_STM32F207.c
Purpose : Physical layer for the internal flash of ST STM32F207 MCU.
Literature:
  [1] RM0033 Reference manual STM32F205xx, STM32F207xx, STM32F215xx and STM32F217xx advanced ARM-based 32-bit MCUs
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32F2\STM32F2xx_RM_rev4_1112.pdf)
  [2] PM0059 Programming manual STM32F205xx, STM32F207xx, STM32F215xx, STM32F217xx
    (\\fileserver\Techinfo\Company\ST\MCU\STM32\STM32F2\STM32F2xx_FlashProgramming_Rev4_1105.pdf)
Additional information:
  This physical layer expects that the parameters of the internal flash
  memory such as number of wait states and the dual bank mode are already
  configured correctly.

  The FS_NOR_PHY_MAX_NUM_BYTES define must be is set according to the supply
  voltage of the MCU as described in the following table taken from [2]

  Supply voltage   FS_NOR_PHY_MAX_NUM_BYTES
  (V)              (bytes)
  -----------------------------------------
  2.7 - 3.6        4
  2.1 - 2.7        2
  1.8 - 2.1        1
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"
#include <stm32f207xx.h>

/*********************************************************************
*
*       Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_PHY_MAX_NUM_BYTES
  #define FS_NOR_PHY_MAX_NUM_BYTES      4   // Maximum number of bytes that can be written at once.
#endif

#ifndef   FS_NOR_PHY_USE_OS
  #define FS_NOR_PHY_USE_OS             0   // 0: polling mode, 1: event driven
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_PHY_USE_OS
  #include "FS_OS.h"
  #include "RTOS.h"
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       Flash interface registers
*/
#define FLASH_BASE_ADDR         0x40023C00uL
#define FLASH_ACR               (*(volatile U32 *)(FLASH_BASE_ADDR + 0x00))
#define FLASH_KEYR              (*(volatile U32 *)(FLASH_BASE_ADDR + 0x04))
#define FLASH_OPTKEYR           (*(volatile U32 *)(FLASH_BASE_ADDR + 0x08))
#define FLASH_SR                (*(volatile U32 *)(FLASH_BASE_ADDR + 0x0C))
#define FLASH_CR                (*(volatile U32 *)(FLASH_BASE_ADDR + 0x10))
#define FLASH_OPTCR             (*(volatile U32 *)(FLASH_BASE_ADDR + 0x14))

/*********************************************************************
*
*       Flash keys
*/
#define KEYR_KEY1               0x45670123
#define KEYR_KEY2               0xCDEF89AB

/*********************************************************************
*
*       Status bits
*/
#define SR_EOP_BIT              0
#define SR_OPERR_BIT            1
#define SR_WRPERR_BIT           4
#define SR_PGAERR_BIT           5
#define SR_PGPERR_BIT           6
#define SR_PGSERR_BIT           7
#define SR_BUSY_BIT             16

/*********************************************************************
*
*       Control bits
*/
#define CR_PG_BIT               0     // Start programming
#define CR_SER_BIT              1
#define CR_SNB_BIT              3
#define CR_SNB_MASK             0xFuL
#define CR_PSIZE_BIT            8
#define CR_PSIZE_8              0uL
#define CR_PSIZE_16             1uL
#define CR_PSIZE_32             2uL
#define CR_PSIZE_MASK           0x3uL
#define CR_STRT_BIT             16
#define CR_EOPIE_BIT            24
#define CR_ERRIE_BIT            25
#define CR_LOCK_BIT             31    // Register access protection

/*********************************************************************
*
*       Flash acceleration bits
*/
#define ACR_DCEN_BIT            10
#define ACR_DCRST_BIT           12

/*********************************************************************
*
*       Misc. defines
*/
#define MAX_SECTOR_BLOCKS       3             // Number of different sector sizes.
#define WAIT_TIMEOUT_MS         70000
#define WAIT_TIMEOUT_CYCLES     100000000uL   // This is the number of cycles required to create a delay of about 7 seconds at a CPU frequency of 120 MHz
#define FLASH_PRIO              15

/*********************************************************************
*
*       ASSERT_SECTOR_INDEX_IS_IN_RANGE
*/
#if FS_DEBUG_LEVEL >= FS_DEBUG_LEVEL_CHECK_ALL
  #define ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex)                              \
    if (SectorIndex >= _NumSectorsUsed) {                                           \
      FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F2: Invalid sector index.\n")); \
      FS_X_PANIC(FS_ERRCODE_INVALID_PARA);                                          \
    }
#else
  #define ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex)
#endif

/*********************************************************************
*
*      Local data types
*
**********************************************************************
*/

/*********************************************************************
*
*      SECTOR_BLOCK
*
*  A sector block defines a number of adjacent sectors of the same size.
*  It therefor contains the size (of one sector) and number of sectors in the block.
*  The entire sectorization can be described with just a few sector blocks.
*/
typedef struct {
  U32 SectorSize;
  U32 NumSectors;
} SECTOR_BLOCK;

/*********************************************************************
*
*      Static const
*
**********************************************************************
*/
static const SECTOR_BLOCK _aSectorBlockDevice[MAX_SECTOR_BLOCKS] = {   // This is the organization of the internal flash.
  {16  * 1024, 4},
  {64  * 1024, 1},
  {128 * 1024, 7}
};

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
static U32            _BaseAddr;                            // Address of the first byte of flash        (configured)
static U32            _StartAddrConf;                       // Address of the first byte used as storage (configured)
static U32            _NumBytes;                            // Number of bytes to be used as storage     (configured)
static U32            _StartAddrUsed;                       // Start address actually used (aligned to start of a sector)
static SECTOR_BLOCK   _aSectorBlockUsed[MAX_SECTOR_BLOCKS]; // Sector blocks actually used as storage.
static U8             _NumSectorBlocksUsed;                 // Number of sector blocks used as storage.
static U8             _FirstSectorIndex;                    // Index of the first physical sector used for storage.
static U8             _NumSectorsUsed;                      // Number of physical sectors used as storage.
#if FS_NOR_PHY_USE_OS
  static volatile U32 _Status;
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

