jfazekas21/blackBird-ESP32-S3/source/components/JFS/Sample/Driver/NOR/ST_STM32F207/FS_NOR_PHY_ST_STM32F207.c
    NumSectors = _aSectorBlockDevice[i].NumSectors;
    SectorSize = _aSectorBlockDevice[i].SectorSize;
    //
    // Take care of bytes to skip before data area.
    //
    while (NumSectors && (NumBytesToSkip > 0)) {
      if (NumBytesToSkip > SectorSize) {
        NumBytesToSkip  -= SectorSize;
      } else {
        NumBytesToSkip   = 0;
      }
      NumBytesSkipped += SectorSize;
      NumSectors--;
      SectorIndex++;
    }
    if (NumSectors) {
      U32 NumSectorsRem;

      NumSectorsRem = NumBytesRem / SectorSize;
      if (NumSectors > NumSectorsRem) {
        NumSectors  = NumSectorsRem;
        NumBytesRem = 0;      // No more sectors after this to make sure that the sectors are adjacent!
      } else {
        NumBytesRem -= NumSectors * SectorSize;
      }
      //
      // Take care of bytes to skip after data area.
      //
      if (NumSectors) {
        if (NumSectorBlocksUsed == 0) {
          StartAddrUsed    = BaseAddr + NumBytesSkipped;      // Remember address of first sector used.
          FirstSectorIndex = SectorIndex;
        }
        pSectorBlockUsed->SectorSize = SectorSize;
        pSectorBlockUsed->NumSectors = NumSectors;
        ++NumSectorBlocksUsed;
        ++pSectorBlockUsed;
        NumSectorsUsed += NumSectors;
      }
    }
  }
  _NumSectorBlocksUsed = NumSectorBlocksUsed;
  _NumSectorsUsed      = NumSectorsUsed;
  _StartAddrUsed       = StartAddrUsed;
  _FirstSectorIndex    = FirstSectorIndex;
  //
  // Perform a sanity check.
  //
  if (NumSectorBlocksUsed == 0) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32F2: Flash size to small for this configuration."));
    return 1;
  }
  return 0;
}

/*********************************************************************
*
*      Static code (public via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*      _PHY_WriteOff
*
*   Function description
*     This routine writes data into any section of the flash. It does not
*     check if this section has been previously erased; this is in the
*     responsibility of the user program.
*     Data written into multiple sectors at a time can be handled by this
*     routine.
*
*   Parameters
*     Unit      Unit number of physical layer
*     Off       Byte offset to read from
*     pData     [IN]  Data to be written to flash
*     NumBytes  Number of bytes to write
*
*   Return value
*     ==0   OK, data has been written
*     !=    An error occurred
*/
static int _PHY_WriteOff(U8 Unit, U32 Off, const void * pData, U32 NumBytes) {
  int r;

  FS_USE_PARA(Unit);
  r = 0;              // OK, data written to flash.
  if (NumBytes != 0u) {
    r = _WriteOff(Off, pData, NumBytes);
  }
  return r;
}

/*********************************************************************
*
*       _PHY_ReadOff
*
*  Function description
*    Physical layer function. Reads data from the given byte offset of the flash.
*
*  Parameters
*    Unit       Unit number of physical layer
*    pData      [OUT] Data read from flash
*    Off        Byte offset to read from
*    NumBytes   Number of bytes to read
*
*  Return value
*    ==0    OK, data read from flash
*    !=0    An error occurred
*/
static int _PHY_ReadOff(U8 Unit, void * pData, U32 Off, U32 NumBytes) {
  U32 ReadAddr;
  U32 StartAddr;
  int r;

  FS_USE_PARA(Unit);
  StartAddr = _StartAddrUsed;
  ReadAddr  = StartAddr + Off;
  FS_MEMCPY(pData, (U8 *)ReadAddr, NumBytes);
  r = 0;      // OK, data read from flash.
  return r;
}

/*********************************************************************
*
*      _PHY_EraseSector
*
*  Function description
*    Physical layer function. Erases one physical sector.
*
*  Parameters
*    Unit           Unit number of physical layer
*    SectorIndex    Index of physical sector to erase
*
*  Return value
*    ==0    OK, sector is erased
*    !=0    An error occurred
*/
static int _PHY_EraseSector(U8 Unit, unsigned int SectorIndex) {
  int r;
  int IsLocked;

  FS_USE_PARA(Unit);
  ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex);
  SectorIndex += _FirstSectorIndex;
  (void)_WaitForEndOfOperation();
  IsLocked = _Unlock();
  _StartErase(SectorIndex);
  r = _WaitForEndOfOperation();
  _CompleteErase();
  _InvalidateCache();         // Invalidate the cache to ensure data consistency (See [2] page 13).
  if (IsLocked != 0) {
    _Lock();
  }
  return r;
}

/*********************************************************************
*
*       _PHY_GetSectorInfo
*
*  Function description
*    Physical layer function. Returns the byte offset and length in bytes of
*    the physical sector with the given index.
*
*  Parameters
*    Unit           Unit number of physical layer
*    SectorIndex    Index of physical sector to query. The index is relative to start of storage.
*    pOff           [OUT] Byte offset of physical sector
*    pLen           [OUT] Length of physical sector in bytes
*/
static void _PHY_GetSectorInfo(U8 Unit, unsigned int SectorIndex, U32 * pOff, U32 * pLen) {
  U32 SectorOff;
  U32 SectorSize;

  FS_USE_PARA(Unit);
  //
  // Fail if the SectorIndex is out of bounds or the device parameters are not set.
  //
  ASSERT_SECTOR_INDEX_IS_IN_RANGE(SectorIndex);
  //
  // Compute result.
  //
  SectorSize = _GetSectorSize(SectorIndex);
  SectorOff  = _GetSectorOff(SectorIndex);
  if (pOff) {
    *pOff = SectorOff;
  }
  if (pLen) {
    *pLen = SectorSize;
  }
}

/*********************************************************************
*
*       _PHY_GetNumSectors
*
*  Function description
*    Physical layer function. Returns the number of logical sectors which can be stored to flash.
*
*  Parameters
*    Unit     Unit number of physical layer
*
*  Return value
*    <=0      An error occurred
*    > 0      Number of logical sectors which can be stored to NOR flash
*/
static int _PHY_GetNumSectors(U8 Unit) {
  int r;

  FS_USE_PARA(Unit);
  r = _NumSectorsUsed;
  return r;
}

/*********************************************************************
*
*       _PHY_Configure
*
*  Function description
*    Physical layer function. Configures the instance of the physical layer.
*
*  Parameters
*    Unit         Unit number of physical layer
*    BaseAddr     Address of the first byte in flash
*    StartAddr    Address of the first byte to be used as storage by the physical layer
*    NumBytes     Number of bytes to use as storage
*/
static void _PHY_Configure(U8 Unit, U32 BaseAddr, U32 StartAddr, U32 NumBytes) {
  FS_USE_PARA(Unit);
  _BaseAddr      = BaseAddr;
  _StartAddrConf = StartAddr;
  _NumBytes      = NumBytes;
}

/*********************************************************************
*
*       _PHY_OnSelectPhy
*
*  Function description
*    Physical layer function. Called right after selection of the physical layer.
*
*  Parameters
*    Unit    Unit number of physical layer
*/
static void _PHY_OnSelectPhy(U8 Unit) {
  FS_USE_PARA(Unit);
}

/*********************************************************************
*
*      _PHY_Init
*
*  Function description
*    Identifies the MCU and computes the start address and the number of sectors used as storage.
*/
static int _PHY_Init(U8 Unit) {
  int r;

  FS_USE_PARA(Unit);
  r = _CalcStorageArea();
#if FS_NOR_PHY_USE_OS
  if (r == 0) {
    NVIC_SetPriority(FLASH_IRQn, FLASH_PRIO);
    NVIC_EnableIRQ(FLASH_IRQn);
  }
#endif // FS_NOR_PHY_USE_OS
  return r;
}

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/
const FS_NOR_PHY_TYPE FS_NOR_PHY_ST_STM32F207 = {
  _PHY_WriteOff,
  _PHY_ReadOff,
  _PHY_EraseSector,
  _PHY_GetSectorInfo,
  _PHY_GetNumSectors,
  _PHY_Configure,
  _PHY_OnSelectPhy,
  NULL,
  NULL,
  _PHY_Init
};

/*************************** End of file ****************************/
